## Pandas  
Pandas is an open-source data manipulation and analysis library for Python. It is built on top of the NumPy library and provides fast and efficient data analysis tools to work with structured data.

In [1]:
import pandas as pd

In [2]:
#Series:
#Homogeneous dataset

#DataFrame : 
#Heterogeneous dataset

**a. Series**  
A 1-dimensional labeled array that can hold any data type such as integers, strings, or floats.

In [3]:
a = pd.Series([1,2,-9,6])  # same as ndarray, series also should be homogeneous
print(a)
print(type(a))

0    1
1    2
2   -9
3    6
dtype: int64
<class 'pandas.core.series.Series'>

In [4]:
a[2]

-9

In [5]:
b = pd.Series([1,2,-12,32],index = ['a','b','c','d'])
b

a     1
b     2
c   -12
d    32
dtype: int64

In [6]:
# can axis through the built in as well as the name given by us
print(b[2])   
print(b['c'])
print(b[1:3])
print(b['a':'d'])

-12
-12
b     2
c   -12
dtype: int64
a     1
b     2
c   -12
d    32
dtype: int64

In [7]:
b['c'] = 12
b[1] = 22
b

a     1
b    22
c    12
d    32
dtype: int64

In [8]:
del b['d']
b

a     1
b    22
c    12
dtype: int64

In [9]:
c = pd.Series([12,5,6,22])
#To print all values greater than 10
print(c>10)
print("________________")
print(c[c>10])

0     True
1    False
2    False
3     True
dtype: bool
________________
0    12
3    22
dtype: int64

In [10]:
d = c + 2
d

0    14
1     7
2     8
3    24
dtype: int64

In [11]:
g = pd.Series([1,0,2,1,2,3],
             index=['white','white','blue','green','green','yellow'])
g

white     1
white     0
blue      2
green     1
green     2
yellow    3
dtype: int64

In [12]:
print('Unique: ',g.unique())
print("__________________________________")
print("Value_Count:\n",g.value_counts())

Unique:  [1 0 2 3]
__________________________________
Value_Count:
 1    2
2    2
0    1
3    1
dtype: int64

In [13]:
print(g.isin([0,3]))
print("_________________")
print(g[g.isin([0,3])])

white     False
white      True
blue      False
green     False
green     False
yellow     True
dtype: bool
_________________
white     0
yellow    3
dtype: int64

**b. DataFrame**  
A 2-dimensional table-like data structure that supports heterogeneous data and allows you to perform operations on rows and columns.

In [14]:
df = pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=['Col1','Col2','Col3','Col3'])

In [15]:
df.head()

      Col1  Col2  Col3  Col3
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [16]:
# .loc is label-based indexing, 
# we can select data based on the row and column labels.
df.loc['Row2']

Col1    4
Col2    5
Col3    6
Col3    7
Name: Row2, dtype: int32

In [17]:
# .iloc is integer-based indexing,
# we can select data based on the row and column positions.
df.iloc[0:2,0:2]

      Col1  Col2
Row1     0     1
Row2     4     5

In [18]:
type(df.iloc[0:1,0:1])

pandas.core.frame.DataFrame

In [19]:
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [20]:
type(df.loc['Row2'])

pandas.core.series.Series

In [21]:
df.describe()

            Col1       Col2       Col3       Col3
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

In [22]:
df[df['Col2'] > 10]

      Col1  Col2  Col3  Col3
Row4    12    13    14    15
Row5    16    17    18    19

In [23]:
from io import StringIO, BytesIO

In [24]:
data = ('Index,col1,col2,col3\n'
        '1,1,  2,  3\n'
        '2,5,  6,  7\n'
        '3,9, 10, 11\n'
       '4,13, 14, 15\n'
       '5,17, 18, 19')

In [25]:
df = pd.read_csv(StringIO(data), usecols=['col1','col3'], dtype = object)
df

  col1 col3
0    1    3
1    5    7
2    9   11
3   13   15
4   17   19

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    5 non-null      object
 1   col3    5 non-null      object
dtypes: object(2)
memory usage: 208.0+ bytes

In [27]:
df = pd.read_csv(StringIO(data), dtype={'col1':object,'col3':float},index_col=0)
df

      col1  col2  col3
Index
1        1     2   3.0
2        5     6   7.0
3        9    10  11.0
4       13    14  15.0
5       17    18  19.0

In [28]:
data = 'a,b\n"Hello, \\"Bob\\", nice to see you",5'

In [29]:
df = pd.read_csv(StringIO(data), escapechar='\\')
df

                               a  b
0  Hello, "Bob", nice to see you  5

In [30]:
url_md = 'https://en.wikipedia.org/wiki/Modern_Family'
    
df = pd.read_html(url_md,match='Episodes')
df[0]

     Season Episodes               Originally aired                Rank  \
     Season Episodes Episodes.1         First aired     Last aired Rank
0         1       24         24  September 23, 2009   May 19, 2010   36
1         2       24         24  September 22, 2010   May 25, 2011   24
2         3       24         24  September 21, 2011   May 23, 2012   15
3         4       24         24  September 26, 2012   May 22, 2013   18
4         5       24         24  September 25, 2013   May 21, 2014   19
5         6       24         24  September 24, 2014   May 20, 2015   24
6         7       22         22  September 23, 2015   May 18, 2016   36
7         8       22         22  September 21, 2016   May 17, 2017   34
8         9       22         22  September 27, 2017   May 16, 2018   58
9        10       22         22  September 26, 2018    May 8, 2019   65
10       11       18         18  September 25, 2019  April 8, 2020   48
11  Special  Special    Special       April 8, 2020  April 8, 2020    —

   Average viewers(in millions)
   Average viewers(in millions)
0                      9.49[51]
1                     11.89[52]
2                     12.93[53]
3                     12.31[54]
4                     11.79[55]
5                     11.91[56]
6                      9.83[57]
7                      8.79[58]
8                      7.09[59]
9                      6.40[60]
10                     7.10[61]
11                            —

In [31]:
data = {'Names':['KNJ','KSJ','MYG','JHS','PJM','KTH','JJK'],
       'DOB':['1994','1992','1993','1994','1995','1995','1997'],
       'City':['Ilsan','Seoul','Deagu','Gwangju','Busan','Deagu','Busan']}
data

{'Names': ['KNJ', 'KSJ', 'MYG', 'JHS', 'PJM', 'KTH', 'JJK'],
 'DOB': ['1994', '1992', '1993', '1994', '1995', '1995', '1997'],
 'City': ['Ilsan', 'Seoul', 'Deagu', 'Gwangju', 'Busan', 'Deagu', 'Busan']}

In [32]:
df = pd.DataFrame(data)
df

  Names   DOB     City
0   KNJ  1994    Ilsan
1   KSJ  1992    Seoul
2   MYG  1993    Deagu
3   JHS  1994  Gwangju
4   PJM  1995    Busan
5   KTH  1995    Deagu
6   JJK  1997    Busan

In [33]:
#To access only one column 
print(df['DOB'])
#or

0    1994
1    1992
2    1993
3    1994
4    1995
5    1995
6    1997
Name: DOB, dtype: object

In [34]:
print(df.DOB)

0    1994
1    1992
2    1993
3    1994
4    1995
5    1995
6    1997
Name: DOB, dtype: object

In [35]:
#To access multiple columns
df[['City','DOB']]

      City   DOB
0    Ilsan  1994
1    Seoul  1992
2    Deagu  1993
3  Gwangju  1994
4    Busan  1995
5    Deagu  1995
6    Busan  1997

In [36]:
df['City'].unique()

array(['Ilsan', 'Seoul', 'Deagu', 'Gwangju', 'Busan'], dtype=object)

In [37]:
df['DOB'].nunique()

5

In [38]:
df.shape

(7, 3)

In [39]:
df.loc[1:3]

  Names   DOB     City
1   KSJ  1992    Seoul
2   MYG  1993    Deagu
3   JHS  1994  Gwangju

In [40]:
df.iloc[1:3]

  Names   DOB   City
1   KSJ  1992  Seoul
2   MYG  1993  Deagu